TwoPhaseFlow-master/run/benchmark/phaseChange/scrivenWedge/scrivenWedge/system/fluid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (0.4995 0.0218 0)
    (0.4995 0.0218 0.5)
    (0 0 0.5)
    (0.4995 -0.0218 0)
    (0.4995 -0.0218 0.5)
);

blocks
(
    hex (0 4 1 0 3 5 2 3) (200 1 200)
    simpleGrading (1 1 1)
);

patches
(
    symmetryPlane faceWall
    (
      (0 4 1 0)
    )

    wedge front
	 (
      (0 1 2 3)
    )

    wedge back
    (
      (0 4 5 3)
    )

    patch outlet
    (
      (1 4 5 2)
      (3 5 2 3)
    )

    empty axis
    (
      (0 3 3 0)
    )
);

// ************************************************************************* //
